# Практическая работа (pandas4.ipynb)

In [1]:
import pandas as pd

In [2]:
# Создать DataFrame из исходных данных
df = pd.DataFrame({
    "имя": ["Анна", "Иван", "Мария"],
    "математика": [85, 70, 90],
    "физика": [78, 82, 88],
    "информатика": [90, 88, 95],
}, index=["S001", "S002", "S003"])
print(df)

        имя  математика  физика  информатика
S001   Анна          85      78           90
S002   Иван          70      82           88
S003  Мария          90      88           95

In [3]:
# Установить столбец student_id в качестве индекса
df.index.name = "student_id"
print(df)

              имя  математика  физика  информатика
student_id
S001         Анна          85      78           90
S002         Иван          70      82           88
S003        Мария          90      88           95

In [4]:
# Получить строку студента с идентификатором S002
print(df.loc["S002"])

имя            Иван
математика       70
физика           82
информатика      88
Name: S002, dtype: object

In [5]:
# Посчитать средний балл по каждому предмету
print(df.mean(axis=0, numeric_only=True))

математика     81.666667
физика         82.666667
информатика    91.000000
dtype: float64

In [6]:
# Посчитать средний балл по каждому студенту
print(df.mean(axis=1, numeric_only=True))

student_id
S001    84.333333
S002    80.000000
S003    91.000000
dtype: float64

In [7]:
# Добавить новый столбец средний_балл
df["средний_балл"] = df.mean(axis=1, numeric_only=True)
print(df)

              имя  математика  физика  информатика  средний_балл
student_id
S001         Анна          85      78           90     84.333333
S002         Иван          70      82           88     80.000000
S003        Мария          90      88           95     91.000000

In [8]:
# Удалить столбец физика
df.drop("физика", axis=1)

              имя  математика  информатика  средний_балл
student_id
S001         Анна          85           90     84.333333
S002         Иван          70           88     80.000000
S003        Мария          90           95     91.000000

In [9]:
# Сбросить индекс обратно в обычный столбец
df.reset_index()

  student_id    имя  математика  физика  информатика  средний_балл
0       S001   Анна          85      78           90     84.333333
1       S002   Иван          70      82           88     80.000000
2       S003  Мария          90      88           95     91.000000